Revit 2027 API
FailuresAccessor.IsElementsDeletionPermitted Method
Overload List
Name | Description
IsElementsDeletionPermitted() |  Checks if resolution of the failures by deleting failure elements is permitted.
IsElementsDeletionPermitted(IList<ElementId>) |  Checks if resolution of the failures by deleting given collection of elements is permitted.
IsElementsDeletionPermitted(IList<ElementId>, String) |  Checks if resolution of the failures by deleting given collection of elements is permitted.
Top
See Also
Reference
FailuresAccessor Class
Autodesk.Revit.DB Namespace